Revit 2026 API

# BuiltInFailuresRebarFailuresTooLargeNumberOfBars Property

---

Rebar Set must contain at most 1002 bar locations.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId TooLargeNumberOfBars { get; }
```
```vb
Public Shared ReadOnly Property TooLargeNumberOfBars As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ TooLargeNumberOfBars {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member TooLargeNumberOfBars : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresRebarFailures Class

Autodesk.Revit.DB Namespace